# Задача 05. Напишите программу, которая принимает на вход координаты двух точек
# и находит расстояние между ними в 2D пространстве (НЕОБЯЗАТЕЛЬНО, ПО ЖЕЛАНИЮ: найти расстояние в 3D пространстве)
# Пример:
# A (3,6); B (2,1) -> 5,09
# A (7,-5); B (1,-1) -> 7,21

X1 = int(input("Введите координату X1 точки A: "))
Y1 = int(input("Введите координату Y1 точки A: "))

X2 = int(input("Введите координату X2 точки B: "))
Y2 = int(input("Введите координату Y2 точки B: "))

result = ((X2 - X1) ** 2 + (Y2 - Y1) ** 2) ** 0.5
result = round(result, 2)
print(result)
